In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series()
print(s)

Series([], dtype: float64)

In [3]:
data = np.array(['a','b','c','d'])
s = pd.Series(data)
s

0    a
1    b
2    c
3    d
dtype: object

In [4]:
d = np.array(['w','sd','f','sf','sww','ee'])
d

array(['w', 'sd', 'f', 'sf', 'sww', 'ee'], dtype='<U3')

In [5]:
sd = pd.Series(d)
sd

0      w
1     sd
2      f
3     sf
4    sww
5     ee
dtype: object

In [6]:
sid = pd.Series(d,index=[4,5,7,8,2,6])
sid

4      w
5     sd
7      f
8     sf
2    sww
6     ee
dtype: object

In [7]:
l = {'a':41,'b':2,'c':4,'d':7}
l

{'a': 41, 'b': 2, 'c': 4, 'd': 7}

In [8]:
ls = pd.Series(l)
ls

a    41
b     2
c     4
d     7
dtype: int64

In [9]:
i = pd.Series(5,index=[4,7,8,5,9])
i

4    5
7    5
8    5
5    5
9    5
dtype: int64

In [10]:
i[:7]

4    5
7    5
8    5
5    5
9    5
dtype: int64

In [11]:
ls['c']

4

In [12]:
sd[:4]

0     w
1    sd
2     f
3    sf
dtype: object

In [13]:
sd[[4,5]]

4    sww
5     ee
dtype: object

In [14]:
data = [1,2,3,4,5]
data

[1, 2, 3, 4, 5]

In [15]:
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [16]:
data1=[['1','hj','gh'],['2','hj','gh'],['3','hj','gh']]
data1

[['1', 'hj', 'gh'], ['2', 'hj', 'gh'], ['3', 'hj', 'gh']]

In [17]:
df1 = pd.DataFrame(data1)

In [18]:
df1

   0   1   2
0  1  hj  gh
1  2  hj  gh
2  3  hj  gh

In [19]:
data2={'Name':['yfj','hj','gh'],'age':['2','4','7'],'fname':['ty','hj','gh']}
data2

{'Name': ['yfj', 'hj', 'gh'],
 'age': ['2', '4', '7'],
 'fname': ['ty', 'hj', 'gh']}

In [20]:
df2=pd.DataFrame(data2)
df2

  Name age fname
0  yfj   2    ty
1   hj   4    hj
2   gh   7    gh

In [21]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
      'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

d

{'one': a    1
 b    2
 c    3
 dtype: int64, 'two': a    1
 b    2
 c    3
 d    4
 dtype: int64}

In [22]:
df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [23]:
d = {'one' : pd.Series([1, 2, 3]),
      'two' : pd.Series([1, 2, 3, 4])}

d

{'one': 0    1
 1    2
 2    3
 dtype: int64, 'two': 0    1
 1    2
 2    3
 3    4
 dtype: int64}

In [24]:
dtd = pd.DataFrame(d)
dtd

   one  two
0  1.0    1
1  2.0    2
2  3.0    3
3  NaN    4

In [25]:
dtd['c'] = pd.Series([4.7,68,5])
dtd

   one  two     c
0  1.0    1   4.7
1  2.0    2  68.0
2  3.0    3   5.0
3  NaN    4   NaN

In [26]:
dtd[2:4]

   one  two    c
2  3.0    3  5.0
3  NaN    4  NaN

In [27]:
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [28]:
dtd = dtd.append(df)

/usr/local/lib/python3.6/site-packages/pandas/core/frame.py:6211: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

In [29]:
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df = df.append(df2)
df

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [30]:
# creating an empty panel
data = np.random.rand(2,4,5)
p = pd.Panel(data)
p

/usr/local/lib/python3.6/site-packages/IPython/core/interactiveshell.py:3267: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  exec(code_obj, self.user_global_ns, self.user_ns)

<class 'pandas.core.panel.Panel'>
Dimensions: 2 (items) x 4 (major_axis) x 5 (minor_axis)
Items axis: 0 to 1
Major_axis axis: 0 to 3
Minor_axis axis: 0 to 4

In [31]:
df.sum()

a    16
b    20
dtype: int64

In [32]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])}
d

{'Name': 0        Tom
 1      James
 2      Ricky
 3        Vin
 4      Steve
 5      Smith
 6       Jack
 7        Lee
 8      David
 9     Gasper
 10    Betina
 11    Andres
 dtype: object, 'Age': 0     25
 1     26
 2     25
 3     23
 4     30
 5     29
 6     23
 7     34
 8     40
 9     30
 10    51
 11    46
 dtype: int64, 'Rating': 0     4.23
 1     3.24
 2     3.98
 3     2.56
 4     3.20
 5     4.60
 6     3.80
 7     3.78
 8     2.98
 9     4.80
 10    4.10
 11    3.65
 dtype: float64}

In [33]:
#Create a DataFrame
df = pd.DataFrame(d)
df

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [34]:
df.describe()

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

In [35]:
df. describe(include='all')

          Name        Age     Rating
count       12  12.000000  12.000000
unique      12        NaN        NaN
top     Gasper        NaN        NaN
freq         1        NaN        NaN
mean       NaN  31.833333   3.743333
std        NaN   9.232682   0.661628
min        NaN  23.000000   2.560000
25%        NaN  25.000000   3.230000
50%        NaN  29.500000   3.790000
75%        NaN  35.500000   4.132500
max        NaN  51.000000   4.800000

In [36]:
a =5
b =4
def adder(a,b):
return a+b

IndentationError: expected an indented block (<ipython-input-36-a376a7c87ae5>, line 4)

In [ ]:
def adder(ele1,ele2):
   return ele1+ele2

df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
df.pipe(adder,2)
a= df.apply(np.mean)
a

In [ ]:
df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
df

In [ ]:
for key,value in df.iteritems():
    print(key,value)

In [ ]:
for key,v in df.iterrows():
    print(key,v)

In [ ]:
df

In [ ]:
for r in df.itertuples():
    print(r)

In [ ]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])

# Select all rows for multiple columns, say list[]
print(df.loc[:,['A','C']])

In [ ]:
print(df.loc[['a','b','f','h'],['A','C','B']])

In [ ]:
print(df.iloc[1:5, 2:3])

In [ ]:
df

In [ ]:
# Slicing through list of values
print(df.iloc[[1, 3, 5], [1, 3]])
print (df.iloc[1:3, :])
print (df.iloc[:,1:3])

In [ ]:
print (df.loc[:,'A'])

In [ ]:
# Integer slicing
print (df.ix[:4])

In [ ]:
s = pd.Series([1,2,3,4,5,4])
s.pct_change()

In [ ]:
df = pd.DataFrame(np.random.randn(5, 2))
df.pct_change()

In [ ]:
s1 = pd.Series(np.random.randn(10))
s2 = pd.Series(np.random.randn(10))
s1.cov(s2)

In [ ]:
df = pd.DataFrame(np.random.randn(10, 4),
index = pd.date_range('1/1/2000', periods=10),
columns = ['A', 'B', 'C', 'D'])
df.rolling(window=3).mean()

In [ ]:
df = pd.DataFrame(np.random.randn(10, 4),
      index = pd.date_range('1/1/2000', periods=10),
      columns = ['A', 'B', 'C', 'D'])
df

In [ ]:
r = df.rolling(window=3,min_periods=1)
r

In [ ]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])
df

In [ ]:
df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h','i'])

In [ ]:
df

In [ ]:
df['one'].isnull()

In [ ]:
df['one'].notnull()

In [ ]:
df.sum()

In [ ]:
empty = pd.DataFrame(index=[0,1,2,3,4,5],columns=['one','two'])
empty

In [ ]:
empty.sum()

In [ ]:
df.fillna(0)

In [ ]:
df.fillna(1)

In [ ]:
df.fillna(method='pad')

In [ ]:
df.fillna(method='backfill')

In [ ]:
df

In [ ]:
df.dropna()

In [ ]:
col =  pd.DataFrame({'one':[10,20,30,40,50,2000],
'two':[1000,0,30,40,50,60]})
col

In [ ]:
col.replace({1000:10,2000:60})
col

In [ ]:
col.replace({1000:10,2000:60})

In [37]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
ipl_data

{'Team': ['Riders',
  'Riders',
  'Devils',
  'Devils',
  'Kings',
  'kings',
  'Kings',
  'Kings',
  'Riders',
  'Royals',
  'Royals',
  'Riders'],
 'Rank': [1, 2, 2, 3, 3, 4, 1, 1, 2, 4, 1, 2],
 'Year': [2014,
  2015,
  2014,
  2015,
  2014,
  2015,
  2016,
  2017,
  2016,
  2014,
  2015,
  2017],
 'Points': [876, 789, 863, 673, 741, 812, 756, 788, 694, 701, 804, 690]}

In [49]:
fd = pd.DataFrame(ipl_data)
fd

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [40]:
fd.groupby('Team').groups

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64'),
 'kings': Int64Index([5], dtype='int64')}

In [41]:
fd.groupby(['Team','Rank']).groups

{('Devils', 2): Int64Index([2], dtype='int64'),
 ('Devils', 3): Int64Index([3], dtype='int64'),
 ('Kings', 1): Int64Index([6, 7], dtype='int64'),
 ('Kings', 3): Int64Index([4], dtype='int64'),
 ('Riders', 1): Int64Index([0], dtype='int64'),
 ('Riders', 2): Int64Index([1, 8, 11], dtype='int64'),
 ('Royals', 1): Int64Index([10], dtype='int64'),
 ('Royals', 4): Int64Index([9], dtype='int64'),
 ('kings', 4): Int64Index([5], dtype='int64')}

In [42]:
tm = fd.groupby('Team').groups

In [43]:
tm = fd.groupby('Team')
for row,group in tm:
    print (row)
    print (group)

Devils
     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673
Kings
    Team  Rank  Year  Points
4  Kings     3  2014     741
6  Kings     1  2016     756
7  Kings     1  2017     788
Riders
      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690
Royals
      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804
kings
    Team  Rank  Year  Points
5  kings     4  2015     812

In [44]:
tm

In [45]:
tm.get_group('Kings')

    Team  Rank  Year  Points
4  Kings     3  2014     741
6  Kings     1  2016     756
7  Kings     1  2017     788

In [46]:
tm['Points'].agg(np.mean)

Team
Devils    768.000000
Kings     761.666667
Riders    762.250000
Royals    752.500000
kings     812.000000
Name: Points, dtype: float64

In [47]:
tm['Points'].agg([np.sum, np.mean, np.std])

         sum        mean         std
Team
Devils  1536  768.000000  134.350288
Kings   2285  761.666667   24.006943
Riders  3049  762.250000   88.567771
Royals  1505  752.500000   72.831998
kings    812  812.000000         NaN

In [50]:
fd.groupby('Team').filter(lambda x: len(x) >= 3)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690